<?php

return [
    '1' => [
        'name' => 'view_vip_articles',
        'display_name' => 'Просмотр избранных статей',
        'description' => 'Пользователю доступна возможность просмотра избранных статей',
    ],

    '2' => [
        'name' => 'create_articles',
        'display_name' => 'Добавление статей',
        'description' => 'Пользователю предоставляется право на создание и добавление статей',
    ],

    '3' => [
        'name' => 'edit_articles',
        'display_name' => 'Редактирование статей',
        'description' => 'Пользователю предоставляется право на редактирование статей',
    ],

    '4' => [
        'name' => 'publish_articles',
        'display_name' => 'Публикация статей',
        'description' => 'Пользователю предоставляется право на опубликовывание статей',
    ],

    '5' => [
        'name' => 'delete_articles',
        'display_name' => 'Удаление статей',
        'description' => 'Пользователю предоставляется право на удаление статей',
    ],

    '6' => [
        'name' => 'view_users',
        'display_name' => 'Просмотр пользователей',
        'description' => 'Пользователю доступна возможнось просмотра списка пользователей',
    ],

    '7' => [
        'name' => 'create_users',
        'display_name' => 'Добавление пользователей',
        'description' => 'Пользователю предоставляется право на создание и добавление пользователей',
    ],

    '8' => [
        'name' => 'edit_users',
        'display_name' => 'Редактирование пользователей',
        'description' => 'Пользователю предоставляется право на редактирование пользователей кроме Super Admin',
    ],

    '9' => [
        'name' => 'activate_users',
        'display_name' => 'Активация пользователей',
        'description' => 'Пользователю предоставляется право на активацию пользователей кроме Super Admin',
    ],

    '10' => [
        'name' => 'delete_users',
        'display_name' => 'Удаление пользователей',
        'description' => 'Пользователю предоставляется право на удаление пользователей кроме Super Admin',
    ],

    '11' => [
        'name' => 'create_edit_delete_roles',
        'display_name' => 'Создание и редактирование ролей',
        'description' => 'Пользователю предоставляется право на создание, редактирование и удаление ролей',
    ],

    '12' => [
        'name' => 'admin_access',
        'display_name' => 'Доступ в панель администратора',
        'description' => 'Пользователю предоставляется доступ в панель администратора',
    ]
];